Week6/theorie.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>theorie</title>
<!-- 2018-03-21 Wed 11:14 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="sil" />
</head>
<body>
<div id="content">
<h1 class="title">theorie</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Parallel versus sequentieel</a>
<ul>
<li><a href="#sec-1-1">1.1. Multiplexer</a></li>
<li><a href="#sec-1-2">1.2. Encoders en decoders</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Prioriteitsencoder</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Selected signal assignment statements</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Parallel versus sequentieel</h2>
<div class="outline-text-2" id="text-1">
<p>
Vanaf pagina 88.
</p>

<p>
Bij sequentiële logica volgen instructies elkaar één na één op, er is dus geheugen
aanwezig, er is een klok nodig etc. Er moet ook rekening gehouden worden met
uitgangen van vorige instructies.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Multiplexer</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Gebruik maken van conditional instructions.
</p>
<ul class="org-ul">
<li>When else
</li>
</ul>
<p>
Syntax: 
</p>
<div class="org-src-container">

<pre class="src src-vhdl"><span class="linenr">1: </span>&lt;target&gt; &lt;= &lt;expression&gt; when &lt;condition&gt; else
<span class="linenr">2: </span>            &lt;expression&gt; when &lt;condition&gt; else
<span class="linenr">3: </span>            ...
<span class="linenr">4: </span>            &lt;expression&gt; when &lt;condition&gt; else
</pre>
</div>
<p>
Altijd zorgen er een "gesloten" situatie bij de laatste else, zo voorkom je
onverwacht gedrag.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Encoders en decoders</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Bij klassieke componenten:
</p>
<ul class="org-ul">
<li>Encoders: meer inputs dan outputs
</li>
<li>Decoders: minder inputs dan outputs
</li>
</ul>
<p>
Bij VHDL worden de ingangen en uitgangen opgeslaan in lookup tables (LUT).
Hier zijn het aantal ingangen en uitgangen irrelevant.
</p>
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Prioriteitsencoder</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Prioriteitsencoders worden vaak gebruikt bij ISR (interrupt service routine).
Via de prioriteitsencoder wordt een interruptprioriteitslijst opgesteld.
</p>

<p>
Bij een prioriteitsencoder te schrijven moet er rekening gehouden worden met
de volgorde van het gelijkstellen van &lt;target&gt; aan &lt;expression&gt;.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Selected signal assignment statements</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: sil</p>
<p class="date">Created: 2018-03-21 Wed 11:14</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
